Repository: TroExol/VoiceInk
Catalog: VoiceInk/Resources/*.lproj/Localizable.strings
Languages: ru

source: Multilingual Model
ru: Мультиязычная модель

source: Mute system audio during recording
ru: Выключать системный звук во время записи

source: Name your power mode
ru: Назовите авто режим

source: Native Apple
ru: Нативная Apple

source: Need help? Check the Help menu for support options
ru: Нужна помощь? Откройте меню помощи для вариантов поддержки

source: No Audio Devices
ru: Нет аудиоустройств

source: No Power Modes
ru: Нет авто режимов

source: No Power Modes Available
ru: Нет доступных авто режимов

source: No Power Modes Yet
ru: Авто режимы ещё не созданы

source: No Replacements
ru: Нет замен

source: No Transcriptions Yet
ru: Транскрипций ещё нет

source: No additional devices available
ru: Дополнительных устройств нет

source: No applications added
ru: Приложения не добавлены

source: No audio files found that are older than (audioRetentionPeriod) day(audioRetentionPeriod > 1 ?
ru: Не найдено аудиофайлов старше (audioRetentionPeriod) дня(audioRetentionPeriod > 1 ?

source: No microphones found
ru: Микрофоны не найдены

source: No model selected
ru: Модель не выбрана

source: No models available
ru: Доступных моделей нет

source: No models loaded
ru: Модели не загружены

source: No prioritized devices
ru: Приоритетные устройства отсутствуют

source: No prompts available
ru: Промпты отсутствуют

source: No providers connected
ru: Провайдеры не подключены

source: No transcription models available. Please connect to a cloud service or download a local model in the AI Models tab.
ru: Нет доступных моделей транскрипции. Подключитесь к облачному сервису или скачайте локальную модель во вкладке "Транскр. ИИ".

source: No transcriptions found
ru: Транскрипции не найдены

source: No websites added
ru: Сайты не добавлены

source: Notch Recorder
ru: Рекордер в вырезе

source: Note: Selecting a device here will override your Mac's system-wide default microphone.
ru: Примечание: выбранное здесь устройство заменит системный микрофон macOS.

source: OK
ru: ОК

source: Older transcripts will be deleted automatically based on your selection.
ru: Старые транскрипции будут автоматически удалены согласно выбранному сроку.

source: Ollama Configuration
ru: Настройка Ollama

source: On-Device
ru: На устройстве

source: Only OpenAI-compatible transcription APIs are supported
ru: Поддерживаются только API транскрипции, совместимые с OpenAI

source: OpenAI Compatible
ru: Совместимо с OpenAI

source: Original
ru: Оригинал

source: Original Text
ru: Исходный текст

source: Original:
ru: Оригинал:

source: Output Format
ru: Формат вывода

source: Paste Last Transcript(Enhanced)
ru: Вставить последнюю AI обработку

source: Paste Last Transcript(Original)
ru: Вставить последнюю оригинальную транскрипцию

source: Pause Media during recording
ru: Приостанавливать медиа при записи

source: Performance Analysis
ru: Анализ производительности

source: Please fix the validation errors before saving.
ru: Исправьте ошибки проверки перед сохранением.

source: Power Modes
ru: Авто режимы

source: Preserve transcript in clipboard
ru: Сохранять транскрипцию в буфере обмена

source: Prioritized Devices
ru: Приоритетные устройства

source: Prompt Instructions
ru: Инструкции для промпта

source: Prompt:
ru: Промпт:

source: Prompt: %@
ru: Промпт: %@

source: Quick tap to start hands-free recording (tap again to stop). Press and hold for push-to-talk (release to stop recording).
ru: Коснитесь, чтобы начать запись без рук (повторное нажатие остановит). Удерживайте для push-to-talk (отпустите для остановки).

source: Quit VoiceInk
ru: Выйти из VoiceInk

source: Recorder Style
ru: Стиль рекордера

source: Recording
ru: Запись

source: Refresh
ru: Обновить

source: Remove
ru: Удалить

source: Remove API Key
ru: Удалить API-ключ

source: Remove Key
ru: Удалить ключ

source: Replacement Text
ru: Текст замены

source: Replacement:
ru: Замена:

source: Report
ru: Отчёт

source: Request Scheduling
ru: Планирование запросов

source: Required
ru: Обязательно

source: Requires OpenAI-compatible API endpoint
ru: Требуется API-эндпоинт, совместимый с OpenAI

source: Reset
ru: Сбросить

source: Reset Onboarding
ru: Сбросить онбординг

source: Retranscription successful
ru: Повторная транскрипция выполнена

source: Retry Last Transcription
ru: Повторить последнюю транскрипцию

source: Run Transcript Cleanup Now
ru: Очистить транскрипции сейчас

source: Save
ru: Сохранить

source: Save Button Preview
ru: Предпросмотр кнопки сохранения

source: Save as MD
ru: Сохранить как MD

source: Save as TXT
ru: Сохранить как TXT

source: Search applications...
ru: Поиск приложений...

source: Search transcriptions
ru: Поиск по транскрипциям

source: Select All
ru: Выбрать всё

source: Select Applications
ru: Выберите приложения

source: Select Language
ru: Выберите язык

source: Select Power Mode
ru: Выберите авто режим

source: Select Section
ru: Выберите раздел

source: Select how you want the recorder to appear on your screen.
ru: Выберите, как должен отображаться рекордер на экране.

source: Select the method used to paste text. Use AppleScript if you have a non-standard keyboard layout.
ru: Выберите способ вставки текста. Используйте AppleScript при нестандартной раскладке.

source: Separate multiple originals with commas, e.g. Voicing, Voice ink, Voiceing
ru: Разделяйте исходные слова запятыми, например: Voicing, Voice ink, Voiceing

source: Server URL
ru: URL сервера

source: Set as Default
ru: Сделать по умолчанию

source: Set as default power mode
ru: Сделать авто режимом по умолчанию

source: Settings
ru: Настройки

source: Setup Required
ru: Требуется настройка

source: Show in Finder
ru: Показать в Finder

source: Sound feedback
ru: Звуковая обратная связь

source: Speed
ru: Скорость

source: Start Transcription
ru: Начать транскрипцию

source: Start recording to see your metrics
ru: Начните запись, чтобы увидеть метрики

source: Start with a Predefined Template
ru: Начать с готового шаблона

source: Default system prompt for improving clarity and accuracy of transcriptions
ru: Системный шаблон по умолчанию для повышения ясности и точности транскрипций

source: Casual chat-style formatting
ru: Неформальное оформление в стиле чата

source: Template for converting casual messages into professional email format
ru: Шаблон для преобразования неформальных сообщений в профессиональный формат письма

source: For Vibe coders and AI chat. Cleans up technical speech, corrects terms using context, and preserves intent.
ru: Для Vibe Coding и диалогов с ИИ. Очищает техническую речь, корректирует термины по контексту и сохраняет исходный замысел.

source: Rewrites transcriptions with enhanced clarity, improved sentence structure, and rhythmic flow while preserving original meaning.
ru: Переписывает транскрипции, повышая ясность, улучшая структуру предложений и ритмику при сохранении исходного смысла.

source: Successfully deleted (cleanupResult.deletedCount) audio files.
ru: Успешно удалено (cleanupResult.deletedCount) аудиофайлов.

source: Successfully deleted (cleanupResult.deletedCount) audio files. Failed to delete (cleanupResult.errorCount) files.
ru: Удалено (cleanupResult.deletedCount) аудиофайлов. Не удалось удалить (cleanupResult.errorCount) файлов.

source: Supported formats: WAV, MP3, M4A, AIFF, MP4, MOV
ru: Поддерживаемые форматы: WAV, MP3, M4A, AIFF, MP4, MOV

source: System Information
ru: Системная информация

source: System Prompt
ru: Системный промпт

source: The emoji "(emojiStr)" is currently used by one or more Power Modes and cannot be removed.
ru: Эмодзи "(emojiStr)" используется в одном или нескольких авто режимах и не может быть удалено.

source: The text transcripts will be preserved.
ru: Текстовые транскрипции будут сохранены.

source: The transcription language is automatically detected by the model.
ru: Язык транскрипции определяется моделью автоматически.

source: This will delete (cleanupInfo.fileCount) audio files older than (audioRetentionPeriod) day(audioRetentionPeriod > 1 ?
ru: Будут удалены (cleanupInfo.fileCount) аудиофайлов старше (audioRetentionPeriod) дня(audioRetentionPeriod > 1 ?

source: Timeout
ru: Таймаут

source: Tip: Use ⌃⌘Space for emoji picker.
ru: Подсказка: используйте ⌃⌘Пробел для эмодзи-панели.

source: Title
ru: Название

source: Toggle AI Enhancement
ru: Переключить AI обработку

source: Toggle Menu Bar Only
ru: Переключить режим только строки меню

source: Total size to be freed: (AudioCleanupManager.shared.formatFileSize(cleanupInfo.totalSize))
ru: Объём освобождённого места: (AudioCleanupManager.shared.formatFileSize(cleanupInfo.totalSize))

source: Transcribing
ru: Транскрибация

source: Transcript Cleanup
ru: Очистка транскрипций

source: Transcription
ru: Транскрипция

source: Transcription Model
ru: Модель транскрипции

source: Transcription Time
ru: Время транскрибирования

source: Transcription Language
ru: Язык транскрипции

source: Transcription Model: (whisperState.currentTranscriptionModel?.displayName ??
ru: Модель транскрипции: (whisperState.currentTranscriptionModel?.displayName ??

source: Transcription Models
ru: Модели транскрипции

source: Transcription Result
ru: Результат транскрипции

source: Enhancement Model
ru: Модель AI обработки

source: Enhancement Time
ru: Время AI обработки

source: Prompt Used
ru: Использованный промпт

source: Trigger Words
ru: Ключевые слова

source: Troubleshooting
ru: Диагностика

source: Try It Out!
ru: Попробуйте!

source: Turn on AI-powered enhancement features
ru: Включите возможности AI обработки

source: Unavailable
ru: Недоступно

source: Update the word or phrase that should be automatically replaced.
ru: Обновите слово или фразу для автоматической замены.

source: Use AppleScript Paste Method
ru: Использовать вставку через AppleScript

source: Use text from clipboard to understand the context
ru: Использовать текст из буфера обмена для контекста

source: User Message
ru: Сообщение пользователя

source: Validation Errors
ru: Ошибки проверки

source: Verify Connection
ru: Проверить подключение

source: Verify and Save
ru: Проверить и сохранить

source: Voice Activity Detection (VAD)
ru: Определение голосовой активности (VAD)

source: VoiceInk requires the following permissions to function properly
ru: Для корректной работы VoiceInk нужны следующие разрешения

source: Permissions
ru: Разрешения

source: Keyboard Shortcut
ru: Горячая клавиша

source: Set up a keyboard shortcut to use VoiceInk anywhere
ru: Настройте горячую клавишу, чтобы использовать VoiceInk где угодно

source: Configure Shortcut
ru: Настроить горячую клавишу

source: Microphone Access
ru: Доступ к микрофону

source: Allow VoiceInk to record your voice for transcription
ru: Разрешите VoiceInk записывать ваш голос для транскрипции

source: Request Permission
ru: Запросить разрешение

source: Open System Settings
ru: Открыть настройки системы

source: Accessibility Access
ru: Доступ к функциям универсального доступа

source: Allow VoiceInk to paste transcribed text directly at your cursor position
ru: Разрешите VoiceInk вставлять транскрибированный текст прямо в текущую позицию курсора

source: Screen Recording Access
ru: Доступ к записи экрана

source: Allow VoiceInk to understand context from your screen for transcript Enhancement
ru: Разрешите VoiceInk считывать контекст с экрана для улучшения транскрипций

source: Warning: Using a prioritized device will override your Mac's system-wide default microphone if it becomes active.
ru: Внимание: приоритетное устройство заменит системный микрофон macOS, как только станет активным.

source: We'll download the optimized model to get you started.
ru: Скачаем оптимизированную модель, чтобы вы могли начать.

source: Websites
ru: Сайты

source: Welcome to VoiceInk
ru: Добро пожаловать в VoiceInk

source: Welcome to the Future of Typing
ru: Добро пожаловать в будущее набора текста

source: Word Replacements
ru: Замены слов

source: YOU'VE SAVED ⏳
ru: ВЫ СЭКОНОМИЛИ ⏳

source: You are
ru: Вы

source: You can only customize the trigger words for system prompts.
ru: Настраивать ключевые слова можно только для системных промптов.

source: You now have full access to VoiceInk without subscription prompts.
ru: Теперь у вас полный доступ к VoiceInk без напоминаний о подписке.

source: Your Shortcut
ru: Ваша горячая клавиша

source: Your history will appear here
ru: Здесь будет отображаться ваша история

source: ms
ru: мс

source: my website link
ru: ссылка на мой сайт

source: or
ru: или

source: with VoiceInk
ru: с VoiceInk

# Language.English
source: English
ru: Английский

# Language.Russian
source: Russian
ru: Русский

source: Dashboard
ru: Панель

source: Words Dictated
ru: Слов произнесено

source: VoiceInk Sessions
ru: Сессий VoiceInk

source: Average Words/Minute
ru: Среднее слов в минуту

source: Words/Session
ru: Слов за сессию

source: SPEAKING TIME
ru: ВРЕМЯ РЕЧИ

source: TYPING TIME
ru: ВРЕМЯ ПЕЧАТИ

source: Switch between available languages
ru: Переключайтесь между доступными языками

source: faster
ru: быстрее

source: API Endpoint
ru: API-адрес

source: Display Name
ru: Отображаемое имя

source: Model Name
ru: Имя модели

source: My Custom Model
ru: Моя пользовательская модель

source: Update Model
ru: Обновить модель

source: your-api-key
ru: ваш API-ключ

# alerts.coremlSupport.message
source: This Whisper model supports Core ML, which can improve performance by 2-4x on Apple Silicon devices. During the first run, it can take several minutes to optimize the model for your system. Subsequent runs will be much faster.
ru: Эта модель Whisper поддерживает Core ML, что может повысить производительность в 2–4 раза на устройствах Apple Silicon. При первом запуске оптимизация под вашу систему может занять несколько минут. Повторные запуски будут значительно быстрее.

# alerts.coremlSupport.title
source: Core ML Support for %@ Model
ru: Поддержка Core ML для модели %@

# alerts.exportSettings.encodeError
source: Could not encode settings to JSON: %@.
ru: Не удалось сохранить настройки в JSON: %@.

# alerts.importSettings.configureButton
source: Configure API Keys
ru: Настроить API-ключи

# alerts.importSettings.generalError
source: Error importing settings: %@. The file might be corrupted or not in the correct format.
ru: Ошибка импорта настроек: %@. Возможно, файл повреждён или имеет неверный формат.

# alerts.importSettings.missingURL
source: Could not get the file URL from the open panel.
ru: Не удалось получить ссылку на файл в диалоговом окне.

# alerts.importSettings.reconfigure
source: IMPORTANT: If you were using AI enhancement features, please make sure to reconfigure your API keys in the Enhancement section.
ru: ВАЖНО: если вы использовали функции улучшения ИИ, убедитесь, что заново настроили API-ключи в разделе «Улучшение».

# alerts.importSettings.restartRecommendation
source: It is recommended to restart VoiceInk for all changes to take full effect.
ru: Рекомендуется перезапустить VoiceInk, чтобы все изменения вступили в силу.

# alerts.importSettings.successMessage
source: Settings imported successfully from %@. All settings (including general app settings) have been applied.
ru: Настройки успешно импортированы из %@. Все параметры (включая общие настройки приложения) применены.

# alerts.importSettings.versionMismatch
source: The imported settings file (version %@) is from a different version than your application (version %@). Proceeding with import, but be aware of potential incompatibilities.
ru: Файл настроек (версия %@) создан в другой версии приложения (версия %@). Импорт будет продолжен, но возможны несовместимости.

# customModel.validation.apiEndpointEmpty
source: API endpoint cannot be empty
ru: API-адрес не может быть пустым

# customModel.validation.apiEndpointInvalid
source: API endpoint must be a valid URL
ru: API-адрес должен быть корректным URL

# customModel.validation.apiKeyEmpty
source: API key cannot be empty
ru: API-ключ не может быть пустым

# customModel.validation.displayNameEmpty
source: Display name cannot be empty
ru: Отображаемое имя не может быть пустым

# customModel.validation.duplicateName
source: A model with this name already exists
ru: Модель с таким именем уже существует

# customModel.validation.modelNameEmpty
source: Model name cannot be empty
ru: Имя модели не может быть пустым

# customModel.validation.nameEmpty
source: Name cannot be empty
ru: Имя не может быть пустым

# errors.ollama.invalidRequest
source: System prompt is required
ru: Требуется системный промпт

# errors.ollama.invalidResponse
source: Invalid response from Ollama server
ru: Некорректный ответ сервера Ollama

# errors.ollama.invalidURL
source: Invalid Ollama server URL
ru: Некорректный URL сервера Ollama

# errors.ollama.modelNotFound
source: Selected model not found
ru: Выбранная модель не найдена

# errors.ollama.serverError
source: Ollama server error
ru: Ошибка сервера Ollama

# errors.ollama.serviceUnavailable
source: Ollama service is not available
ru: Сервис Ollama недоступен

# notifications.aiEnhancementFailed
source: AI enhancement failed
ru: Не удалось выполнить улучшение ИИ

# notifications.cannotRetryAudioMissing
source: Cannot retry: Audio file not found
ru: Не удаётся повторить: аудиофайл не найден

# notifications.copiedToClipboard
source: Copied to clipboard
ru: Скопировано в буфер обмена

# notifications.failedToCopyTranscription
source: Failed to copy transcription
ru: Не удалось скопировать транскрипт

# notifications.lastTranscriptionCopied
source: Last transcription copied
ru: Последний транскрипт скопирован

# notifications.modelAlreadyExists
source: A model named %@.bin already exists
ru: Модель с именем %@.bin уже существует

# notifications.modelImportFailed
source: Failed to import model: %@
ru: Не удалось импортировать модель: %@

# notifications.modelImported
source: Imported %@
ru: Импортировано %@

# notifications.noAIModelSelected
source: No AI Model Selected
ru: Не выбрана модель ИИ

# notifications.noAudioDetected
source: No Audio Detected
ru: Аудио не обнаружено

# notifications.noTranscriptionAvailable
source: No transcription available
ru: Нет доступной транскрипции

# notifications.noTranscriptionModelSelected
source: No transcription model selected
ru: Не выбрана модель транскрипции

# notifications.pressEscAgain
source: Press ESC again to cancel recording
ru: Нажмите ESC ещё раз, чтобы отменить запись

# notifications.recordingCorrupted
source: Recording failed - audio file corrupted
ru: Не удалось сохранить запись — аудиофайл повреждён

# notifications.recordingError
source: Recording error: %@
ru: Ошибка записи: %@

# notifications.recordingFailedToStart
source: Recording failed to start
ru: Не удалось начать запись

# notifications.retryFailed
source: Retry failed: %@
ru: Не удалось повторить: %@

# notifications.transcriptionFailed
source: Transcription Failed
ru: Ошибка транскрипции

# notifications.usingDevice
source: Using: %@
ru: Используется: %@

# support.email.body
source: ------------------------ ✨ **SCREEN RECORDING HIGHLY RECOMMENDED** ✨ ▶️ Create a quick screen recording showing the issue! ▶️ It helps me understand and fix the problem much faster. 📝 ISSUE DETAILS: - What steps did you take before the issue occurred? - What did you expect to happen? - What actually happened instead? ## 📋 COMMON ISSUES: Check out our Common Issues page before sending an email: https://tryvoiceink.com/common-issues ------------------------ System Information: %@
ru: ------------------------ ✨ **ОЧЕНЬ РЕКОМЕНДУЕМ ПРИЛОЖИТЬ ЗАПИСЬ ЭКРАНА** ✨ ▶️ Сделайте короткую запись экрана с демонстрацией проблемы! ▶️ Это поможет быстрее понять ситуацию и найти решение. 📝 ОПИСАНИЕ ПРОБЛЕМЫ: - Какие действия вы выполняли перед возникновением проблемы? - Что вы ожидали увидеть? - Что произошло на самом деле? ## 📋 ЧАСТЫЕ ПРОБЛЕМЫ: Перед отправкой письма загляните на страницу распространённых вопросов: https://tryvoiceink.com/common-issues ------------------------ Сведения о системе: %@

# support.email.subject
source: VoiceInk Support Request
ru: Запрос в поддержку VoiceInk

# support.email.systemInfo
source: App Version: %@ macOS Version: %@ Device: %@ CPU: %@ Memory: %@
ru: Версия приложения: %@ Версия macOS: %@ Устройство: %@ CPU: %@ Память: %@

# transcription.enhancementFailedFormat
source: Enhancement failed: %@
ru: Не удалось улучшить: %@

# transcription.failedFormat
source: Transcription Failed: %@
ru: Ошибка транскрипции: %@
