Repository: TroExol/VoiceInk
Catalog: VoiceInk/Resources/*.lproj/Localizable.strings
Languages: ru

source: (efficiencyMultiplierFormatted) Faster
ru: в (efficiencyMultiplierFormatted) быстрее

source: (modelStat.fileCount) transcripts
ru: (modelStat.fileCount) транскрипций

source: 1 day
ru: 1 день

source: 1 hour
ru: 1 час

source: 14 days
ru: 14 дней

source: 3 days
ru: 3 дня

source: 30 days
ru: 30 дней

source: 30-Day VoiceInk Trend
ru: Тренд VoiceInk за 30 дней

source: 7 days
ru: 7 дней

source: A New Way to Type
ru: Новый способ печати

source: AI Enhancement
ru: AI обработка

source: AI Model
ru: AI-модель

source: AI Model: (aiService.currentModel)
ru: AI-модель: (aiService.currentModel)

source: AI Provider
ru: AI-провайдер

source: AI Provider Integration
ru: Интеграция AI-провайдера

source: AI Provider: (aiService.selectedProvider.rawValue)
ru: AI-провайдер: (aiService.selectedProvider.rawValue)

source: AI Models
ru: Транскр. ИИ

source: AI Request
ru: AI запрос

source: Enhancement
ru: AI обработка

source: Power Mode
ru: Авто режим

source: Add New Power Mode
ru: Добавить авто режим

source: Edit Power Mode
ru: Редактировать авто режим

source: New Power Mode
ru: Новый авто режим

source: Default Power Mode
ru: Авто режим по умолчанию

source: Default power mode is used when no specific app or website matches are found
ru: Авто режим по умолчанию используется, когда нет совпадений по приложениям или сайтам.

source: What is Power Mode?
ru: Что такое авто режим?

source: Automatically apply custom configurations based on the app/website you are using
ru: Автоматически применяйте свои настройки в зависимости от активного приложения или сайта.

source: Cannot Save Power Mode
ru: Не удалось сохранить авто режим

source: Reorder
ru: Изменить порядок

source: When to Trigger
ru: Условия срабатывания

source: Advanced
ru: Дополнительно

# autoSend.tip
source: Automatically presses Return/Enter after pasting. Handy for chats or forms when no edits are needed.
ru: Автоматически нажимает Return/Enter после вставки — удобно для чатов и форм, где правки не нужны.

source: New Prompt
ru: Новый промпт

source: Edit Prompt
ru: Редактировать промпт

source: Save Changes
ru: Сохранить изменения

source: Language: English (only)
ru: Язык: английский (только)

# models.currentModel
source: Current model: %@
ru: Текущая модель: %@

# models.englishOnlyHint
source: This is an English-optimized model and only supports English transcription.
ru: Эта модель оптимизирована под английский и поддерживает только английскую транскрибацию.

# models.multilingualHint
source: This model supports multiple languages. Select a specific language or auto-detect (if available).
ru: Модель поддерживает несколько языков. Выберите конкретный язык или автоопределение (если доступно).

# models.filter.recommended
source: Recommended
ru: Лучшее

# models.filter.local
source: Local
ru: Локальные

# models.filter.cloud
source: Cloud
ru: Облако

# models.filter.custom
source: Custom
ru: Своя

# models.button.download
source: Download
ru: Скачать

# models.button.downloading
source: Downloading...
ru: Скачиваем...

# models.info.importLocalTitle
source: Import local Whisper models
ru: Импорт локальных моделей Whisper

# models.info.importLocalMessage
source: Add a custom fine-tuned Whisper model to use with VoiceInk. Select the downloaded .bin file.
ru: Добавьте собственную дообученную модель Whisper для работы в VoiceInk. Укажите скачанный .bin-файл.

# models.info.importLocalHelp
source: Read more about custom local models
ru: Подробнее о локальных моделях

# models.infotip.outputFormatTitle
source: Output Format Guide
ru: Памятка по формату

# models.infotip.outputFormatMessage
source: Unlike GPT, Voice models (Whisper) follow the style of your prompt rather than instructions. Use examples of your desired output format instead of commands.
ru: Voice модели (Whisper) следуют примеру в вашем промпте, а не инструкциям. Используйте образец нужного оформления вместо команд.

# models.infotip.trailingSpaceTitle
source: Trailing Space
ru: Пробел после вставки

# models.infotip.trailingSpaceMessage
source: Automatically adds a space after pasted text. Useful for space-delimited languages.
ru: Автоматически добавляет пробел после вставленного текста. Полезно для языков с разделением пробелами.

# models.infotip.autoFormattingTitle
source: Automatic Text Formatting
ru: Автоформатирование текста

# models.infotip.autoFormattingMessage
source: Apply intelligent formatting to break large blocks of text into paragraphs.
ru: Применяет разумное форматирование и разбивает длинные блоки текста на абзацы.

# models.infotip.vadTitle
source: Voice Activity Detection
ru: Обнаружение речи (VAD)

# models.infotip.vadMessage
source: Detect speech segments and filter out silence to improve the accuracy of local models.
ru: Определяет сегменты речи и убирает тишину, чтобы повысить точность локальных моделей.

# enhancement.tip.enableMessage
source: AI enhancement lets you pass the transcribed audio through LLMs to post-process with prompts for emails, summaries, writing, and more.
ru: AI обработка пропускает транскрипт через LLM, чтобы дооформлять его промптами: для писем, саммари, переписок и других сценариев.

# enhancement.maxAttempts
source: Max attempts: %d
ru: Макс. попыток: %d

source: API Endpoint URL (e.g., https://api.example.com/v1/chat/completions)
ru: URL API-эндпоинта (например, https://proxy.domain.ru/v1/chat/completions)

source: API Key
ru: API-ключ

source: API Key Configuration
ru: Настройка API-ключа

source: API key verified successfully!
ru: API-ключ успешно проверен!

source: Accuracy
ru: Точность

source: Activation Delay
ru: Задержка активации

source: Active
ru: Активно

source: Add
ru: Добавить

source: Add App
ru: Добавить приложение

source: Add Emoji
ru: Добавить эмодзи

source: Add New
ru: Добавить

source: Add Custom Model
ru: Добавить свою модель

source: Add Model
ru: Добавить модель

source: Add Power Mode
ru: Добавить авто режим

source: Add Replacement
ru: Добавить замену

source: Add Word Replacement
ru: Добавить замену слова

source: Add a brief description of what this prompt does
ru: Добавьте краткое описание назначения этого промпта

source: Add another hotkey
ru: Добавить ещё одну горячую клавишу

source: Add customized power modes for different contexts
ru: Добавляйте авто режимы для разных контекстов

source: Add multiple words that can activate this prompt
ru: Добавьте несколько слов, которые будут активировать этот промпт

source: Add space after paste
ru: Добавлять пробел после вставки

source: Add trigger word
ru: Добавить ключевое слово

source: Add word replacements to automatically replace text.
ru: Добавьте замены слов для автоматической корректировки текста.

source: Add word to dictionary
ru: Добавить слово в словарь

source: Add word
ru: Добавить слово

source: Add new replacement
ru: Добавить новую замену

source: Edit replacement
ru: Редактировать замену

source: Enable automatic word replacement after transcription
ru: Включить автоматическую замену слов после транскрипции

source: Retranscribe this audio
ru: Перетранскрибировать это аудио

source: Add new prompt
ru: Добавить новый промпт

source: Add custom emoji
ru: Добавить свою эмодзи

source: Refresh models
ru: Обновить модели

source: Automatically pause active media playback during recordings and resume afterward.
ru: Автоматически приостанавливать воспроизведение медиа во время записи и возобновлять после

source: Remove word
ru: Удалить слово

source: Add words so AI enhancement understands them correctly. (Requires AI enhancement)
ru: Добавьте слова, чтобы AI обработка понимала их корректно (требуется AI обработка)

source: Add words so AI enhancement understands them correctly
ru: Добавьте слова, чтобы AI обработка понимала их корректно

source: Automatically replace specific words or phrases with custom formatted text
ru: Автоматически заменяйте слова и фразы на заданный формат

source: Correct Spellings
ru: Правильные написания

# Dictionary Items Count Format
source: Dictionary Items (%d)
ru: Элементы словаря (%d)

# Dictionary duplicate word message
source: '%@' is already in the dictionary
ru: "%@" уже есть в словаре

# HotkeyOption.None
source: None
ru: Нет

# HotkeyOption.RightOption
source: Right Option (⌥)
ru: Правый Option (⌥)

# HotkeyOption.LeftOption
source: Left Option (⌥)
ru: Левый Option (⌥)

# HotkeyOption.LeftControl
source: Left Control (⌃)
ru: Левый Control (⌃)

# HotkeyOption.RightControl
source: Right Control (⌃)
ru: Правый Control (⌃)

# HotkeyOption.RightCommand
source: Right Command (⌘)
ru: Правый Command (⌘)

# HotkeyOption.RightShift
source: Right Shift (⇧)
ru: Правый Shift (⇧)

# HotkeyOption.Custom
source: Custom
ru: Своя комбинация

source: Microphone:
ru: Микрофон:

source: Select Device
ru: Выберите устройство

source: Unknown Device
ru: Неизвестное устройство

source: VoiceInk Shortcuts
ru: Горячие клавиши VoiceInk

source: Choose how you want to trigger VoiceInk
ru: Выберите, как вы хотите запускать VoiceInk

source: Launch at Login
ru: Запускать при входе

source: Import VoiceInk Settings
ru: Импорт настроек VoiceInk

source: Export VoiceInk Settings
ru: Экспорт настроек VoiceInk

source: Import Canceled
ru: Импорт отменён

source: The settings import operation was canceled.
ru: Импорт настроек был отменён.

source: Export Canceled
ru: Экспорт отменён

source: The settings export operation was canceled.
ru: Экспорт настроек был отменён.

source: Hotkey 1
ru: Горячая клавиша 1

source: Hotkey 2
ru: Горячая клавиша 2

source: Export Error
ru: Ошибка экспорта

source: Export Successful
ru: Экспорт выполнен успешно

# alerts.exportSettings.successMessage
source: Your settings have been successfully exported to %@.
ru: Ваши настройки были успешно экспортированы в %@.

source: Import Error
ru: Ошибка импорта

# alerts.exportSettings.writeError
source: Could not save settings to file: %@.
ru: Не удалось сохранить настройки в файл: %@.

source: Import Successful
ru: Импорт выполнен успешно

source: Save Transcription
ru: Сохранить транскрипцию

source: Select a Whisper ggml .bin model
ru: Выберите модель Whisper ggml .bin

source: Version Mismatch
ru: Несовпадение версий

source: VoiceInk Onboarding
ru: Онбординг VoiceInk

source: Run Cleanup Now
ru: Запустить очистку

source: Analyzing...
ru: Анализируем...

source: Choose a location to save your settings.
ru: Выберите место для сохранения настроек.

source: Choose a settings file to import. This will overwrite ALL settings (prompts, power modes, dictionary, general app settings).
ru: Выберите файл настроек для импорта. Это перезапишет ВСЕ настройки (промпты, power mode, словарь, общие параметры приложения).

source: Additional shortcuts for VoiceInk
ru: Дополнительные горячие клавиши VoiceInk

source: Customize app & system feedback
ru: Настройте отклики приложения и системы

source: Recording Feedback
ru: Отклики при записи

source: Automatically mute system audio when recording starts and restore when recording stops
ru: Автоматически отключать системный звук во время записи и восстанавливать после завершения

source: Keep the transcribed text in clipboard instead of restoring the original clipboard content
ru: Сохранять транскрибированный текст в буфере вместо восстановления исходного содержимого

source: Other App Shortcuts
ru: Прочие горячие клавиши

source: Enable or disable AI enhancement.
ru: Включайте или выключайте AI обработку.

source: Quickly move to the next enhancement prompt to match the current conversation.
ru: Быстро переключайтесь на следующий промпт обработки, чтобы подстроиться под текущий диалог.

source: Pastes the enhanced transcript if available, otherwise falls back to the original.
ru: Вставляет улучшенную транскрипцию, если она доступна, иначе возвращается к оригиналу.

source: Re-transcribe the last recorded audio using the current model and copy the result.
ru: Повторно транскрибирует последнюю запись текущей моделью и копирует результат.

source: Dismiss Recording
ru: Отменить запись

source: Shortcut for cancelling the current recording session. Default: double-tap Escape.
ru: Сочетание для отмены текущей записи. По умолчанию: двойное нажатие Escape.

source: Middle-Click Toggle
ru: Переключение средней кнопкой

source: Use middle mouse button to toggle VoiceInk recording.
ru: Используйте среднюю кнопку мыши, чтобы переключать запись VoiceInk.

source: General
ru: Общие

source: Appearance, startup, and updates
ru: Внешний вид, автозапуск и обновления

source: Data & Privacy
ru: Данные и конфиденциальность

source: Control transcript history and storage
ru: Управляйте историей транскрипций и хранением данных

source: Data Management
ru: Управление данными

source: Import or export your settings
ru: Импортируйте или экспортируйте настройки

source: Interface Language
ru: Язык интерфейса

source: Paste Method
ru: Способ вставки

source: Choose how text is pasted
ru: Выберите способ вставки текста

source: Choose your preferred recorder interface
ru: Выберите предпочтительный интерфейс рекордера

source: Permission required for VoiceInk to function properly
ru: Для корректной работы VoiceInk требуется разрешение

source: Additional
ru: Дополнительно

source: Edit Custom Model
ru: Редактировать свою модель

source: All features unlocked
ru: Все функции разблокированы

source: Analyze
ru: Анализировать

source: App Permissions
ru: Разрешения приложения

source: Applications
ru: Приложения

source: Are you sure you want to reset the onboarding? You'll see the introduction screens again the next time you launch the app.
ru: Сбросить онбординг? При следующем запуске снова появятся приветственные экраны.

source: Audio Cleanup
ru: Очистка аудио

source: Audio Input
ru: Аудиовход

source: System Default
ru: Системное устройство по умолчанию

source: Custom Device
ru: Выбранное устройство

source: Prioritized
ru: Приоритетные устройства

source: Use system's default input device
ru: Использовать системное устройство ввода по умолчанию

source: Select a specific input device
ru: Выбрать конкретное устройство ввода

source: Set up device priority order
ru: Настроить порядок приоритетов устройств

source: Audio file selected: %@
ru: Выбран файл: %@

source: Audio Duration
ru: Длительность аудио

source: Audio files older than the selected period will be automatically deleted, while keeping the text transcripts intact.
ru: Аудиофайлы старше выбранного срока будут автоматически удалены, текстовые транскрипции сохранятся.

source: Auto Send
ru: Автоотправка

source: Autodetected
ru: Автоопределение

source: Automate your workflows with context-aware configurations.
ru: Автоматизируйте работу с учётом контекста.

source: Automatic text formatting
ru: Автоматическое форматирование текста

source: Automatically delete transcript history
ru: Автоматически удалять историю транскрипций

source: Available Devices
ru: Доступные устройства

source: Avg. Enhancement Time
ru: Среднее время AI обработки

source: Base URL
ru: Базовый URL

source: Before Copy
ru: До копирования

source: Built-in
ru: Встроенный

source: Cancel
ru: Отмена

source: Cancel Shortcut
ru: Отмена горячей клавиши

source: Check for Updates
ru: Проверить обновления

source: Check for Updates Now
ru: Проверить обновления сейчас

source: Check for Updates…
ru: Проверить обновления…

source: Choose Different File
ru: Выбрать другой файл

source: Choose File
ru: Выбрать файл

source: Cleanup Complete
ru: Очистка завершена

source: Cleanup triggered. Old transcripts are cleaned up according to your retention setting.
ru: Очистка запущена. Старые транскрипции удалены согласно настройкам хранения.

source: Click here and start speaking...
ru: Нажмите здесь и начните говорить...

source: Clipboard Context
ru: Контекст буфера обмена

source: Cloud Model
ru: Облачная модель

source: Complete Setup
ru: Завершить настройку

source: Complete the setup to get started
ru: Завершите настройку, чтобы начать работу

source: Configure
ru: Настроить

source: Configure your microphone preferences
ru: Настройте предпочтения для микрофона

source: Improve AI enhancement accuracy by teaching it your vocabulary
ru: Улучшайте точность AI обработки, обучая её вашей лексике

source: Configured
ru: Настроено

source: Connect an audio input device to get started
ru: Подключите устройство аудиоввода, чтобы начать

source: Connected to
ru: Подключено к

source: Context Awareness
ru: Контекст экрана

source: Control how VoiceInk handles your transcription data and audio recordings for privacy and storage management.
ru: Управляйте тем, как VoiceInk обрабатывает транскрипции и аудиозаписи для конфиденциальности и экономии места.

source: Copy Enhanced
ru: Копировать AI обработку

source: Copy Last Transcription
ru: Скопировать последнюю транскрипцию

source: Copy Original
ru: Скопировать оригинал

source: Create first power mode to automate your VoiceInk workflow based on apps/website you are using
ru: Создайте первый авто режим, чтобы автоматизировать VoiceInk под используемые приложения и сайты

source: Current model: (currentModel.displayName)
ru: Текущая модель: (currentModel.displayName)

source: Custom
ru: Пользовательский

source: Custom Cancel Shortcut
ru: Пользовательская клавиша отмены

source: Custom Provider
ru: Пользовательский провайдер

source: Custom Provider Configuration
ru: Настройка пользовательского провайдера

source: Cycle Enhancement Prompt
ru: Переключить промпт AI обработки

source: Default
ru: По умолчанию

source: Default Model
ru: Модель по умолчанию

source: Define a word or phrase to be automatically replaced.
ru: Укажите слово или фразу для автоматической замены.

source: Define how AI should enhance your transcriptions
ru: Определите, как AI будет улучшать ваши транскрипции

source: Define word replacements to automatically replace specific words or phrases
ru: Настройте замены, чтобы автоматически заменять нужные слова или фразы

source: Delete
ru: Удалить

source: Delete (cleanupInfo.fileCount) Files
ru: Удалить (cleanupInfo.fileCount) файлов

source: Delete Model
ru: Удалить модель

source: Delete Selected Items?
ru: Удалить выбранные элементы?

source: Delete transcripts older than
ru: Удалять транскрипции старше

source: Description
ru: Описание

source: Deselect All
ru: Снять выделение

source: Devices will be used in order of priority. If a device is unavailable, the next one will be tried. If no prioritized device is available, the system default microphone will be used.
ru: Устройства используются по порядку приоритетов. Если устройство недоступно, VoiceInk перейдёт к следующему. При отсутствии приоритетных устройств будет использован системный микрофон.

source: Dictionary
ru: Словарь

source: Dictionary Items ((dictionaryManager.items.count))
ru: Элементов в словаре: (dictionaryManager.items.count)

source: Dictionary Settings
ru: Настройки словаря

source: Disabled
ru: Отключено

source: Dismiss
ru: Закрыть

source: Done
ru: Готово

source: Double-click to edit • Right-click for more options
ru: Дважды кликните для редактирования • Правый клик для дополнительных действий

source: Download AI Model
ru: Скачать AI-модель

source: Downloaded
ru: Скачано

source: Drop audio or video file here
ru: Перетащите аудио- или видеофайл сюда

source: Duration: %@
ru: Длительность: %@

source: Each attempt times out after interval × remaining attempts.
ru: Каждая попытка истекает по формуле интервал × оставшиеся попытки.

source: Edit
ru: Изменить

source: Edit Model
ru: Редактировать модель

source: Edit Word Replacement
ru: Изменить замену

source: Editing: (title)
ru: Редактирование: (title)

source: Emoji in Use
ru: Эмодзи используется

source: Enable
ru: Включить

source: Enable AI Enhancement
ru: Включить AI обработку

source: Enable Enhancement
ru: Включить AI обработку

source: Enable Middle-Click Toggle
ru: Включить переключение средней кнопкой

source: Enable automatic audio cleanup
ru: Включить автоматическую очистку аудио

source: Enable automatic update checks
ru: Включить авто-проверку обновлений

source: Enhance VoiceInk's transcription accuracy by teaching it your vocabulary
ru: Улучшайте точность транскрипций VoiceInk, обучая его своей лексике

source: Enhance your transcriptions with AI
ru: Улучшайте транскрипции с помощью AI

source: Enhanced
ru: AI обработка

source: Enhancement Models
ru: Модели AI обработки

source: Enhancement Prompt
ru: Промпт AI обработки

source: Enhancing
ru: AI обработка

source: Enter a description
ru: Введите описание

source: Enter a short, descriptive title
ru: Введите короткое описательное название

source: Enter website URL (e.g., google.com)
ru: Введите URL сайта (например, google.com)

source: Enter word or phrase to replace (use commas for multiple)
ru: Введите заменяемые слова или фразы (через запятую)

source: Enter your API Key
ru: Введите свой API-ключ

source: Error
ru: Ошибка

source: Examples
ru: Примеры

source: Experimental
ru: Экспериментально

source: Experimental Features
ru: Экспериментальные функции

source: Experimental features that might be unstable & bit buggy.
ru: Экспериментальные функции, которые могут быть нестабильными или с ошибками.

source: Export
ru: Экспорт

source: Export Settings...
ru: Экспорт настроек...

source: Export your custom prompts, power modes, word replacements, keyboard shortcuts, and app preferences to a backup file. API keys are not included in the export.
ru: Экспортируйте свои промпты, авто режимы, замены слов, горячие клавиши и настройки приложения в резервную копию. API-ключи не экспортируются.

source: Faster than Real-time
ru: Быстрее реального времени

source: Feedback or Issues?
ru: Есть отзыв или проблема?

source: For best results, using your Mac's built-in microphone is recommended.
ru: Для лучшего результата рекомендуем использовать встроенный микрофон Mac.

source: Generating waveform...
ru: Формируется волновая форма...

source: Get API Key
ru: Получить API-ключ

source: Get Started
ru: Начать

source: Help and Support
ru: Помощь и поддержка

source: Hide Dock Icon (Menu Bar Only)
ru: Скрыть значок в Dock (только строка меню)

source: History
ru: История

# history.loadMore
source: Load More
ru: Загрузить ещё

# history.loading
source: Loading...
ru: Загрузка...

# history.selectionCount
source: %ld selected
ru: Выбрано %ld

# history.deleteConfirmationMessage
source: This action cannot be undone. Are you sure you want to delete %ld items?
ru: Это действие нельзя отменить. Удалить %ld элементов?

source: Icon
ru: Иконка

source: Immediately
ru: Сразу

source: Import Local Model…
ru: Импортировать локальную модель…

source: Import Settings...
ru: Импорт настроек...

source: Imported
ru: Импортировано

source: Imported local model
ru: Импортирована локальная модель

source: Input Mode
ru: Режим ввода

source: Invalid API key. Please check your key and try again.
ru: Неверный API-ключ. Проверьте ключ и попробуйте снова.

source: Keep audio files for
ru: Хранить аудиофайлы

source: Language
ru: Язык

source: Language: (currentLanguageDisplayName())
ru: Язык: (currentLanguageDisplayName())

source: Language: Autodetected
ru: Язык: автоматическое определение

source: Language: English
ru: Язык: английский

source: Launch interval (s)
ru: Интервал запуска (с)

source: Learn More
ru: Подробнее

source: Learn more
ru: Подробнее

source: Learn what is on the screen to understand the context
ru: Определяйте содержимое экрана для лучшего контекста

source: Let's test your VoiceInk setup.
ru: Давайте протестируем настройку VoiceInk.

source: Manage AI Models
ru: Управлять Транскр. ИИ

source: Manage AI Providers
ru: Управлять AI-провайдерами

source: Manage Models
ru: Управлять моделями

source: Mini Recorder
ru: Мини-рекордер

source: Model
ru: Модель

source: Model Name (e.g., gpt-4o-mini, claude-3-5-sonnet-20240620)
ru: Название модели (например, deepseek-reasoner, deepseek-chat, qwen-turbo)
